In [7]:
import pandas as pd

In [25]:
temp61 = pd.read_csv('mean_temp61.csv').rename({'cl1' : 'Year' , 'cl2' : 'mean_temp'}, axis =1)
temp61.head()

   Year  mean_temp
0  1961        8.6
1  1961       12.4
2  1961       14.5
3  1961       16.8
4  1961       20.6

In [26]:
temp91 = pd.read_csv('mean_temp91.csv').rename({'cl1' : 'Year' , 'cl2' : 'mean_temp'}, axis =1)
temp91.head()

   Year  mean_temp
0  1991        9.0
1  1991        9.5
2  1991       12.5
3  1991       14.7
4  1991       18.1

In [32]:
data_temp = pd.concat([temp61,temp91])
data_temp.head(15)

    Year  mean_temp
0   1961        8.6
1   1961       12.4
2   1961       14.5
3   1961       16.8
4   1961       20.6
5   1961       22.5
6   1961       27.5
7   1961       26.9
8   1961       23.3
9   1961       17.9
10  1961       13.7
11  1961       11.8
12  1962       10.3
13  1962        9.9
14  1962       12.6

In [33]:
data_temp.dtypes

Year           int64
mean_temp    float64
dtype: object

In [40]:
annual_mean_temp = data_temp.groupby('Year')['mean_temp'].mean().to_frame()
annual_mean_temp.head()

      mean_temp
Year
1961  18.041667
1962  17.416667
1963  17.083333
1964  17.466667
1965  17.041667

In [42]:
annual_mean_temp.shape

(60, 1)

In [43]:
annual_mean_temp.isna().sum()

mean_temp    0
dtype: int64

In [44]:
annual_mean_temp.to_csv('annual_mean_temp')